{
    "books": [
        {
            "id": 20171020,
            "title": "Molten Coil",
            "PageURL": "book.php?title=Molten%20Coil",
            "cover125": "MoltenCoil125.jpg",
            "cover240": "MoltenCoil240.jpg",
            "heatlevel": "spicy",
            "series": "Silver Bound",
            "genre": "Science Fiction",
            "keyword":  [
                "space western", "spaceship", "space opera", "space romance", "Silver Bound"
            ],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "October 20, 2017",
            "tagline": "Silver Bound #2",
            "excerpt": "MOL",
            "Amz": "B076J59YS3",
            "Nook": 2940154892107,
            "Kobo": "molten-coil",
            "iTune": "id1297839735",
            "blurb": "\n<p>Lieutenant Brice Levski commands his Mounty deputies with aloof precision. It's the only way to keep citizens in his corner of the universe safe. When one of his best deputies falls victim to the latest nano-silver tech, all his cool reserve and control is flushed out the space hatch.\n<\/p><p>Deputy Olivia Celeston dedicates her life to taking down the corrupt, the rich and powerful. After all, they defy the rules the most--that includes her Lieutenant, even if she hasn't found the dirt on him yet.\n<\/p><p>Accidentally infected with the countdown bug during a bust, Livy gets her shot to work closely with Brice and finally see what makes him tick. If the countdown doesn't kill her first. Or the wild and remote planet Coil, with its deadly volcanoes. Or the drug dealers responsible for tying her life to Brice--unable to be more than a few feet away from him without a painful death.\n<\/p><p>All that wouldn't be a problem, if being close didn't send them both molten, and the countdown of Livy's life wasn't winding down as fast as their waning control.\n<\/p>\n"
        },
        {
            "id": 20171201,
            "title": "The Hightower Affair",
            "PageURL": "book.php?title=The%20Hightower%20Affair",
            "cover125": "Hightower125.jpg",
            "cover240": "Hightower240.jpg",
            "heatlevel": "spicy",
            "series": "stand-alone",
            "genre": "Science Fiction",
            "keyword":  ["Science Fiction", "Cyberpunk"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "December 01, 2017",
            "tagline": "Grab on, the world tilts",
            "excerpt": "ZET",
            "Amz": "B077VQ3QHL",
            "Nook": 2940154983829,
            "Kobo": "the-hightower-affair",
            "iTune": "id1320081920",
            "blurb": "\n<p>Zetter Kohl lives in the alleys of the Lower Quarters. He'll do anything to survive, or so he believes. But when a thwarted mugging leads him into the life of a citizen of the city, Zetter discovers what it really means to live in-between.\n<\/p><p>This urban-set cyberpunk follows Zetter through his journey from street punk to noir detective to crime solver. It contains moments of violence and explicit scenes.\n<\/p>\n"
        },
        {
            "id": 20170814,
            "title": "Phoenix Warrior",
            "PageURL": "book.php?title=Phoenix%20Warrior",
            "cover125": "PhoenixWarrior125.jpg",
            "cover240": "PhoenixWarrior240.jpg",
            "heatlevel": "spicy",
            "series": "The Phoenix Cycle",
            "genre": "Science Fiction Romance",
            "keyword":  ["espionage", "genes", "military", "first contact", "alien", "spaceship", "space opera", "space romance", "shapeshifter", "phoenix", "Space Grit"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "August 14, 2017",
            "tagline": "The 1st Space Grit Two spin-off",
            "excerpt": "PH1",
            "Amz": "B072JX77TH",
            "Nook": 2940154203958,
            "Kobo": "phoenix-warrior",
            "iTune": "id1269265633",
            "blurb": "\n<p>In the outer reaches, facing the imminent destruction of her ship, Captain Anna Voron accepts help from newly-discovered, space-faring phoenix\nshifters. Their leader awakens dark memories and makes trust impossible but she's out of choices.<\/p>\n<p>Piotr dom Raven lives for duty. And that duty has two goals: become a full phoenix with reincarnation abilities and \nwin a decades-long war threatening to destroy their kind. The intriguing captain of a derelict ship changes everything. \nHis phoenix wants her, but mating a human means permanent death and deserting his command.<\/p>\n<p>The enemy of old has Anna in his sights and Piotr can't stop the diabolical plans set in motion. \nIf Anna can face her past and Piotr can follow his phoenix instincts, they stand a chance to save the endangered crew. \nBut will they find the key to survival in time?<\/p>\n"
        },
        {
            "id": 20170606,
            "title": "Space Grit Bundle",
            "PageURL": "book.php?title=Space%20Grit%20Bundle",
            "cover125": "SpaceGritBundle125.jpg",
            "cover240": "SpaceGritBundle240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien", "Love is love", "LGBT", "monster", "prison romance", "asteroid", "spaceship", "space romance", "cyborg"],
            "pub": "Ella Drake",
            "length": "Bundle",
            "date": "June 6, 2017",
            "tagline": "Currently unavailable",
            "Amz": "B071JPNHMF",
            "Nook": 2940154728383,
            "Kobo": "space-grit-bundle",
            "iTune": "id1246377316",
            "blurb": "\n<p>Catch up on the&nbsp;<strong>Space Grit<\/strong>&nbsp;series before the release of the last book,&nbsp;<strong>Breaking the Admiral<\/strong>. \nThis bundle starts with&nbsp;<strong>Black Ice Heart<\/strong>&nbsp;and the origins of the Scoriah brothers who form the Bronson family. \nBooks 2-6 take us through the journeys of Warrant, Echtei, and Tee finding their mates with two additional stories, included here in order: \na romance between their heart-sister with her closet-monster. And an epilogue-type story for Tee and Mal's new addition to the family.<\/p>\n<p>We're not done with the Bronson family after the completion of this first series. In&nbsp;<strong>Killer Mate<\/strong>, \nwe met a character from another set of aliens, the phoenix. The Scoriah and phoenix will clash and mix in the future in a \nspin-off series,&nbsp;<strong>The Phoenix Cycle<\/strong>. And as you'll see in&nbsp;<strong>Breaking the Admiral<\/strong>, \nwe still need to find mates for Chaz, Nick, and Quad.<\/p>\n<p>All stories are hot, action-packed, and end with HEA (Happily ever after).<\/p>\n\n\n"
        },
        {
            "id": 20170717,
            "title": "Breaking the Admiral",
            "PageURL": "book.php?title=Breaking%20the%20Admiral",
            "cover125": "BreakingAdmiral125.jpg",
            "cover240": "BreakingAdmiral240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien", "marriage of convenience", "Jane Eyre"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "July 17, 2017",
            "tagline": "A marriage to a Scoriah is never convenient",
            "excerpt": "ADM",
            "Amz": "B072JX3TMK",
            "Nook": 2940154703458,
            "Kobo": "breaking-the-admiral",
            "iTune": "id1245488339",
            "blurb": "\n      <p>A marriage to a Scoriah is never convenient\n<\/p><p>\nWhen Admiral Lucinda Ryan seeks a political deal for a husband, she negotiates a trade arrangement for her family and in return, secures the position of the alien Scoriah. All she wants is a marriage of convenience: a man in her bed, her ex unable to claim a hold on her family, and a trained killer to protect her daughter. If he growls while she makes him burn, all the better--as long as all that heat stays in her cabin where it belongs.\n<\/p><p>\nTay Bronson sacrifices himself to keep his family safe. If he has to have intimate relations with a human who can't tell him and his brothers apart, at least he can make her beg for her pleasure. Or at least, that's the plan. But when she introduces him to his insta-daughter whose sleep is disturbed nightly by what she claims is a ghost, he gets more than he bargained for. Keeping his family safe now means facing monsters he never saw coming.\n<\/p><p>\nThis full-length, gender-flipped Jane Eyre in space is a standalone but connected novel in the Space Grit universe. Be ready for action, explicit scenes, and a guaranteed HEA (Happily Ever After)\n<\/p>\n"
        },
        {
            "id": 20161019,
            "title": "Cinder Mated",
            "PageURL": "book.php?title=Cinder%20Mated",
            "cover125": "CinderMated125.jpg",
            "cover240": "CinderMated240.jpg",
            "cover360": "CinderMated360.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"sort.php?series=Cinder%20Mated\">Cinder Mated<\/a>\n\t",
            "series": "Cinder Mated",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "Elementals"],
            "pub": "Ella Drake",
            "length": "Collection",
            "date": 2016,
            "tagline": "Three novellas, one story.",
            "Amz": "B01M3SPP4T",
            "AmzPrint": 1539517160,
            "blurb": "\n    <p>Para-talents blend into humanity but not without help. The Cinders keep watch and maintain balance of the elemental powers at their disposal. But a rogue group challenges their authority. The only way to face the growing dangers is to give in to desire and join talents with their mates. Stronger together, the Cinders seek their true partners...and claim them.\n<\/p>\n    <p>This collection contains the entire series of novellas:<\/p>\n    <ol>\n      <li>Desire the Banshee<\/li>\n      <li>Tame the Storm<\/li>\n      <li>Seduce the Flame<\/li>\n    <\/ol>\t"
        },
        {
            "id": 20160929,
            "title": "Wellington's Surprise",
            "PageURL": "book.php?title=Wellington's%20Surprise",
            "cover125": "WellingtonsSurprise125.jpg",
            "cover240": "WellingtonsSurprise240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien", "cyborg"],
            "pub": "Ella Drake",
            "length": "Novella",
            "date": "September 29, 2016",
            "tagline": "Letting go is never an option",
            "excerpt": "WLG",
            "Amz": "B01M19W253",
            "Nook": 2940153538976,
            "Kobo": "wellington-s-surprise",
            "iTune": "id1160465072",
            "CrSpace": 6641394,
            "AmzPrint": 1539498972,
            "blurb": "\n<p>Tee and Mal finally get away for some alone time as a newly mated couple, but the tech responsible for Mal's last two cyborg bodies has a surprise. A new Scoriah addition brings the couple to the brink and they react the only way they can, they dig in with their claws and hearts. \n <\/p><p>\nLetting go is never an option.\n <\/p><p>\nThis short story is part of the SPACE GRIT series. It is intended to be read after KILLER MATE and is not standalone. \n <\/p><p>\nWarning: This story contains adult language, situations, and medical peril for the newest Bronson addition. As always, there is a happy ending.\n <\/p>\n\n\n",
            "buy": "\n<div style=\"text-align: center\"><p>THIS NOVELLA IS AVAILABLE IN PRINT WITH KILLER MATE<\/p><\/div>\n\t"
        },
        {
            "id": 20160531,
            "title": "Killer Mate",
            "PageURL": "book.php?title=Killer%20Mate",
            "cover125": "KillerMate200x300.jpg",
            "cover240": "KillerMate240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien", "cyborg"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "May 31, 2016",
            "tagline": "Finding a mate can be a killer",
            "excerpt": "KMT",
            "Amz": "B01CILYEIM",
            "Nook": 2940153232881,
            "Kobo": "killer-mate",
            "iTune": "id1119040222",
            "CrSpace": 6641394,
            "AmzPrint": 1539498972,
            "blurb": "\n<p>Tee Bronson doesn't trust outsiders. Never has. Now the Scoriah are on the run from the Nex, a secretive black-ops unit, and trust isn't even in his vocabulary. Except he needs help to board a military vessel to free one of his brothers. The only person in the universe that he's sure isn't Nex is Malweather Hunter, his former lover. Problem is, last time Tee saw Mal, he killed him.\n<\/p><p>If there's one thing a former bounty hunting cyborg should avoid, it's the alien who turned him inside out, left him for dead, and ruined his career. Even reminded that he's homeless, broke, and bitter, Mal can't resist the reason for it all. Tee makes his cold body run hot. Besides, if anyone's going to kill Tee, it's going to be him. The Nex will just have to wait their turn to get their hands on his lover's enticing neck.<\/p>\n<p>Warning: This novel is intended for readers 18 and older. It contains explicit scenes, language, violence.<\/p>\n\n",
            "buy": "\n\n\t"
        },
        {
            "id": 20151210,
            "title": "Willing Skin",
            "PageURL": "book.php?title=Willing%20Skin",
            "cover125": "WillingSkin240.jpg",
            "cover240": "WillingSkin240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "November, 2015",
            "tagline": "What lies beneath the skin",
            "excerpt": "WSK",
            "Amz": "B0196QZWOC",
            "Nook": 2940152857306,
            "Kobo": "willing-skin",
            "iTune": "id1091881015",
            "CrSpace": 6641391,
            "AmzPrint": 1539498913,
            "blurb": "\n\n<p>Sylla Viola has never put down roots. When she's forced to abandon her life, she leaves everything behind. Nothing to miss. Nothing to regret. Not even the loss of her body. Using a DNA mod that changes her into a male half-human Scoriah, she's poised to get away from the hunter on her trail. Until she runs into the one man who can see through her disguise. \n<\/p><p>Docked at <i>Station Viesel<\/i>, Echtei Bronson helps a lost male Scoriah. One minute in his company threatens Echtei's control. One glimpse of the woman inside and he can't keep his hands off. One heated touch and he gives in to the need to wreak havoc on anyone who touches Sylla--a woman who could never stay with a man forever tied to family and home. \n<\/p><p>But even Echtei can't defeat what's chasing Sylla--a ruthless cyborg hunter who has shown that a Scoriah is no match for him. Echtei won’t give Sylla up without a fight. It's face the impossible or die trying, even if survival means war.\n<\/p><p><i>Willing Skin<\/i> is a full-length science fiction romance novel in the <b>Space Grit<\/b> series and can be read stand-alone.\n<\/p><p>Warning: This novel is intended for readers 18 and older. It contains explicit female/male and (female as male)/male scenes, language, violence.\n<\/p>\n<p><b>EXCERPT<\/b> is intended for mature audiences only\n<\/p>\n\n",
            "buy": ""
        },
        {
            "id": 20151031,
            "title": "Freeker",
            "PageURL": "book.php?title=Freeker",
            "cover125": "Freeker240.jpg",
            "cover240": "Freeker240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien"],
            "pub": "Ella Drake",
            "length": "Novella",
            "date": "October 1, 2015",
            "tagline": "In space... she wants to hear you scream.",
            "excerpt": "FRK",
            "Amz": "B01AV9JS8Y",
            "Nook": 2940152801316,
            "Kobo": "freeker",
            "iTune": "id1077624278",
            "blurb": "\n<p>She's never needed a man but she'll make an exception for her big, sexy alien. \n<\/p>\n<p>***\n<\/p>\n\n<p>Chara has a past. Her memories are used to create an exotic drug called Freeker. But she doesn't remember what she's done or why. She just knows that Warrant can get her away and his unusual DNA means he's safe from her. But how can she convince him to help her escape when it risks everything he holds dear?\n<\/p>\n<p>If there's any way an independent trade ship can make a credit or two to support the Scoriah, pilot Warrant Bronson is willing to give it a go. Smuggling, delivering goods, or gun running--none of it is too risky when it comes to the survival of his brothers and family. \n<\/p>\n<p>When a paid escort turns out to be a stowaway, Warrant has no choice but to run. But ripping away from port leaves the ship damaged and dragging a docking boot. Giving up his uninvited guest is the only way to get his ship free and finish his trade run, but giving up Chara isn't so easy.\n<\/p>\n<p>Freeker is a science fiction romance novella in the Space Grit series. Reading in order is recommended but the story can be read stand-alone\n<\/p>\n<p>Warning: This novel is intended for readers 18 and older. It contains explicit scenes, language, violence.<\/p>\n<p><b>EXCERPT<\/b> is intended for mature audiences only\n<\/p>\n<p>This story was first published October 1, 2015 in the Deep into Darkness box set<\/p>\n",
            "buy": ""
        },
        {
            "id": 20151013,
            "title": "Kilt in Space",
            "PageURL": "book.php?title=Kilt%20in%20Space",
            "cover125": "KiltInSpace240.jpg",
            "cover240": "KiltInSpace240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien"],
            "pub": "Ella Drake",
            "length": "Novella",
            "date": "October 13, 2015",
            "tagline": "A monster. A kilt. And nothing beneath it.",
            "excerpt": "KIS",
            "Amz": "B01AYEPMEK",
            "Nook": 2940152825671,
            "Kobo": "kilt-in-space",
            "iTune": "id1079952280",
            "blurb": "\n<p>A shy monster accidently scares the ship engineer. Not exactly the way he wanted to catch her attention. \n<\/p>\n<p>***\n<\/p>\n<p>Ursula is no stranger to big, snarly aliens. Heart-sister and ship engineer for her brothers, the Scoriah, she's used to claws, fangs, and vicious fighting. On board their new spacefaring cargo hauler, they find everything they need: Smuggling holes, plenty of room, and a brand new engine Ursula can't wait to get to know. But they find something extra on board. A monster that frightens even the intrepid Ursula.\n<\/p>\n<p>Left by the previous crew, Grendel wants nothing more than to escape the monsters who've taken over his ship. Remaining hidden isn't an option for Grendel when the intriguing new engineer misses a crucial problem with the internal systems. Now, it's find a way to approach Ursula or they're all going to die. \n<\/p>\n\n<p>Kilt in Space is a science fiction romance novella in the Space Grit series. Reading in order is recommended but the story can be read stand-alone\n<\/p>\n\n",
            "buy": ""
        },
        {
            "id": 20150921,
            "title": "Black Ice Heart",
            "PageURL": "book.php?title=Black%20Ice%20Heart",
            "cover125": "BlackIceHeart240.jpg",
            "cover240": "BlackIceHeart240.jpg",
            "heatlevel": "spicy",
            "series": "Space Grit",
            "genre": "Science Fiction Romance",
            "keyword":  ["Space Grit", "science fiction romance", "space opera", "SFR", "alien"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "September 21, 2015",
            "tagline": "Passion survives in the cold reaches of space",
            "excerpt": "BIH",
            "Amz": "B014LEWCTW",
            "Nook": 2940152277739,
            "Kobo": "black-ice-heart",
            "iTune": "id1037203968",
            "CrSpace": 6640814,
            "AmzPrint": 1539494586,
            "blurb": "\n<p>Condemned and in transit to an asteroid prison, he found what he'd never had before--a chance to love.\n<\/p>\n<p>***\n<\/p>\n<p>Ensign Joan Holly has one last mission before transferring to a secretive, elite unit, the Nex. It's what she's wanted since joining the military as a child. All she has to do is escort the most reviled prisoner on Geonate to meet his fate.  Simple, since he's immobilized and nobody has ever escaped the Asteroid Pit.\n<\/p>\n<p>Cenak Bronson never had it easy. He's never been free and never had a future. He accepts his doomed fate until he's rescued by a band of half-aliens, the Scoriah. After the chaos of his breakout, Cenak finds himself reluctantly bound to the only other survivor, his jailer Joan. \n<\/p>\n<p>But they aren't the sole survivors by coincidence and they weren't captured by the Scoriah randomly. To survive, they join forces, uncovering secrets and lies that change everything. Including the future of Geonate itself. \n<\/p>\n<p>Black Ice Heart is a full-length science fiction romance novel that begins the Space Grit series and can be read stand-alone\n<\/p>\n<p>Warning: This novel is intended for readers 18 and older. It contains explicit scenes, language, violence.\n<\/p>\n",
            "buy": ""
        },
        {
            "id": 20150429,
            "title": "In Bed with her Alien",
            "PageURL": "book.php?title=In%20Bed%20with%20her%20Alien",
            "cover125": "InBedWithAlien_200x300.jpg",
            "cover240": "InBedWithAlien_240.jpg",
            "heatlevel": "erotic",
            "series": "My Alien Stepbrother",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "SFR", "contemporary", "stepbrother romance", "second chance romance", "alien romance", "suspense", "coming of age", "college romance", "alien abduction", "paparazzi", "new adult", "forced marriage"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "April 29, 2015",
            "tagline": "A college graduate reunites with her alien lover",
            "Amz": "B0108ZTMC8",
            "blurb": "\n<p>Darenda Belafonte wanted to ditch her mother’s wedding, but the painful night made an enticing turn when she ran into her ex at the hotel bar. An alien who’d left her to fulfill his arranged marriage contract, Luke Noon was a distraction she knew was bad for her but one she took anyway. After all, he hadn’t met his fiancé yet. One last time couldn’t hurt. Anything to not think about what her mother had done. After a night blistering the sheets, Darenda and Luke are shocked to find their parents had married in a diplomatic arrangement to join the two worlds.\n<\/p><p>She fully intended to send him packing. Soon as she figured out how to stop landing in bed with him.\n<\/p>\n",
            "buy": ""
        },
        {
            "id": 20150325,
            "title": "Badland's Edge",
            "PageURL": "book.php?title=Badland%27s%20Edge",
            "cover125": "BadlandsEdge125.jpg",
            "cover240": "BadlandsEdge240.jpg",
            "heatlevel": "spicy",
            "series": "New Guardsmen",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "post-apocalyptic", "SFR"],
            "pub": "Ella Drake",
            "length": "Short Novel",
            "date": "March 25, 2015",
            "tagline": "Throwing caution under the wheels of a big rig",
            "Amz": "B00V8CEZBO",
            "Nook": 2940151491556,
            "Kobo": "badland-s-edge",
            "blurb": "\n<p>Two decades after civilization’s fall, Nathan Covington makes his last trucking run into the lawless Midwest dust bowl. The rig he's refurbished has been his entire life, but he’s getting antsy. A change is coming.\n<\/p><p>Hawk, Scout, scary-ass-bitch. She goes by all those names. Her real one doesn't matter. The only thing that does is survival. Food. Shelter. Supplies. A trucker who doesn't want to give her what she wants? Well, he can be sacrificed. Even if he's the one thing she's wanted to steal more than any other.\n<\/p><p>Use caution: story contains a heroine who knows how to throw a knife, a hero who dares to run dark in a big rig, a motorcycle gang who’ll do anything for fuel, and sweltering love in the badlands.\n\n<\/p>\n",
            "buy": ""
        },
        {
            "id": 20170918,
            "title": "Reckless Dragon",
            "PageURL": "book.php?title=Reckless%20Dragon",
            "cover125": "RecklessDragon2017_125.jpg",
            "cover240": "RecklessDragon2017_240.jpg",
            "heatlevel": "spicy",
            "series": "Wild Seas",
            "genre": "Paranormal Romance",
            "keyword":  ["paranormal romance", "PNR", "shifter", "dragon"],
            "pub": "Ella Drake",
            "length": "Novel",
            "date": "September 18, 2017",
            "tagline": "Wild Seas #2",
            "Amz": "B075MRD47S",
            "Nook": 2940154945827,
            "Kobo": "reckless-dragon",
            "blurb": "\n\t<p>Officer Lilly Pride is working  overtime to help solve a rash of disappearances.  When an unusual creature from her past turns out to be involved, she faces the truth.  Fantastical sea dragon shifters are real and someone is stealing them. The strange path of the case takes her to the underworld, Aita. Rescuing the victims means going against everything she's ever believed, breaks her faith in justice,  and gives her a choice: Sacrifice either herself or the man who got her into this mess.\n<\/p><p>\nTroy Bayard hadn't been sure before but when Lilly comes back into his life, he knows exactly what she is. His mate. His to protect. She insists on going to Aita to rescue kidnapped dragons, but he has to stop her. The underworld has no escape, and much as he can't stand for Lilly to go, he has to. His brother is one of the missing and a close call pushes him past the point of no return. Troy's own son is at risk.\n<\/p><p>\nAita is full of the dangers of river ghouls, time distortion, poisonous fruit, and the lure of the gods themselves. But the greatest risk is what traps souls within the realm. Temptation.  Consumption of flesh while in the underworld means no escape, and the call to mate--the call to taste passion--is irresistible.\n<\/p><p>\nEvery touch is a risk.<br />\nEvery touch binds.<br />\nThe destruction of a race is the cost, the only path, to freedom.\n\n\t<\/p>\n\t",
            "buy": ""
        },
        {
            "id": 20141209,
            "title": "River Arrow",
            "PageURL": "book.php?title=River%20Arrow",
            "cover125": "RiverArrow125.jpg",
            "cover240": "RiverArrow240.jpg",
            "heatlevel": "spicy",
            "series": "New Guardsmen",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "post-apocalyptic", "SFR"],
            "pub": "",
            "length": "Novella (ebook)",
            "date": "December 9, 2014",
            "tagline": "After the end of the world, love is escape",
            "Amz": "B00V9FJ6A0",
            "Nook": 2940151491549,
            "Kobo": "river-arrow",
            "blurb": "\n<p>Jared Covington is about to veer off course. He’s survived the end of known civilization by staying focused. His crew, his community, and his own life demand he take no chances. Working the Mississippi River carries enough risk, but it pays to avoid trouble where he can, including never getting involved with the ragtag communities on his trade route. He doesn’t count on Mari and how involved he wants to get.\n<\/p><p>Mari is a survivor. An attacking drifter gang has captured her entire village and she’s the only one who can stop them. If she’s going to die saving her people, least she can do is finally get her hands on Jared, the man she’s dreamed of since she first set eyes on him. When her entire life is upside down may not be the best time to get him in her bed, but she’s not taking chances.\n<\/p><p>Mari knows Jared is her lucky break. She just has to convince him of that. Later. For now, their sizzling attraction is put on hold. Because, unless they free the village from the drifters, there is no future.\n\n<\/p>\n",
            "buy": ""
        },
        {
            "id": 20140301,
            "title": "Captive Dragon",
            "PageURL": "book.php?title=Captive%20Dragon",
            "cover125": "CaptiveDragon2017_125.jpg",
            "cover240": "CaptiveDragon2017_240.jpg",
            "heatlevel": "spicy",
            "series": "Wild Seas",
            "genre": "Paranormal Romance",
            "keyword":  ["paranormal romance", "PNR", "shifter", "dragon"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": "March 1, 2014",
            "tagline": "Love is wild when your mate is a seadragon",
            "Amz": "B00IQKMUOK",
            "Nook": 2940149361717,
            "Kobo": "captive-dragon-1",
            "blurb": "\n<p>Marine biologist Chloe Pearl has had enough of one Reef Bayard, a charismatic animal activist who’s put her job in danger. When she finds him in one of the aquarium’s tanks she knows he’s up to some publicity stunt. She’s determined to uncover his plot, just as soon as she can get that gloriously nude body of his…covered.\n<\/p><p>\nReef isn’t what he appears. He’s a seadragon. And getting netted and on display for Chloe may work in his dreams, but he has to escape the aquarium. Not only doesn’t he want to face the truth, that Chloe must be his mate, but he has work to do protecting other sea creatures.\n<\/p><p>\nBut the deep doesn’t want to let him go, and a creature from his past is out to get him and Chloe. It’s not the best time to claim a mate, but he has nowhere else to run. \n<\/p>\n",
            "buy": ""
        },
        {
            "id": 20131227,
            "title": "Seduce the Flame",
            "PageURL": "book.php?title=Seduce%20the%Flame",
            "cover125": "seducetheflame125.jpg",
            "cover240": "seducetheflame240.jpg",
            "cover360": "seducetheflame360.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Cinder%20Mated\">Cinder Mated<\/a>\n\t",
            "series": "Cinder Mated",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "Elementals"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2013,
            "tagline": "Cinder Mated #3",
            "Amz": "B01AU7F52A",
            "AmzPrint": 1539517160,
            "blurb": "\n\t<p>Fire mage Ray has enough on his plate. He has to clean up after a traitor in the Cinder Task Force plus attend his brother’s nuptials. There’s no time to shore up his crumbling resistance to finding his own mate, but the wedding proves he’s not immune. And water mage Clarissa is temptation itself.\n\t<\/p><p>\n\tClarissa has kept her attraction to Ray to herself. Still, one little dance won’t be a problem. A lingering touch leads to another and her powers erupt, endangering them all. Ray has to get Clarissa away but he doesn’t trust himself alone with her.\n\t<\/p><p>\n\tThen there’s no choice. The traitor escapes and they’re on the chase. Long-buried desires sunder control. The only way to save themselves is to let their passions unite. As long as it isn’t too late.\n\t<\/p>\n\t",
            "buy": ""
        },
        {
            "id": 20130621,
            "title": "Tame the Storm",
            "PageURL": "book.php?title=Tame%20the%20Storm",
            "cover125": "tamethestorm125.jpg",
            "cover240": "tamethestorm240.jpg",
            "cover360": "tamethestorm360.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Cinder%20Mated\">Cinder Mated<\/a>\n\t",
            "series": "Cinder Mated",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "Elementals"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2013,
            "tagline": "Cinder Mated #2",
            "Amz": "B01AU0K0TK",
            "AmzPrint": 1539517160,
            "blurb": "\n\t<p>Storm mage Griffin Cinder rescues a lost para-talent after a mission leaves victims in its wake. His urge to protect her is overpowered by his need to claim her, but he can’t. Astrid Collins is a syphon. Someone he can’t have, no matter how much his body wants hers. Even one fingertip trailing down his body could strip him of his powers, but what a way to go.\n\t<\/p><p>\n\tAstrid intends to betray the Cinder Task Force. If the storm mage has the hots for her, it’s that much easier. Except, she starts to like him. Want him. Badly. As much as she wants him, their lust will ruin her plans, not to mention hurt them both. Just one kiss. That’s all she needs.\n\t<\/p><p>\n\tBut then the storm breaks, plots crash down, and all that’s left is to touch—even if it kills them.\n\t<\/p>\n\t",
            "buy": ""
        },
        {
            "id": 20130402,
            "title": "Demons of Florida",
            "PageURL": "book.php?title=Demons%20of%20Florida",
            "cover125": "DemonsAntho125.jpg",
            "cover240": "DemonsAntho240.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Demons%20of%20Florida\">Demons of Florida<\/a>\n\t",
            "series": "Demons of Florida",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "shifter", "demon", "wolf"],
            "pub": "Ella Drake",
            "length": "Collection",
            "date": 2013,
            "tagline": "All the heat, one package",
            "Amz": "B00C5R99Q2",
            "Nook": 2940016776477,
            "CrSpace": 4229978,
            "AmzPrint": 1484015703,
            "blurb": "Tiago Montevedo has one chance to stop the demons determined to take over what's left of Florida. It's simple. Join forces with a she-wolf whose sole purpose is to kill every hellion stupid enough to cross her path. Except...this she-wolf isn't ready for a partner, much less take demon spawn as a mate. But a man with Montevedo demon blood has a lure no woman can resist, and once she's in his bed, she won't want to leave. If only he could get her to stop fighting long enough to show her just how serious he is."
        },
        {
            "id": 20130331,
            "title": "Demon Branded",
            "PageURL": "book.php?title=Demon%20Branded",
            "cover125": "DemonBranded125.jpg",
            "cover240": "DemonBranded240.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Demons%20of%20Florida\">Demons of Florida<\/a>\n\t",
            "series": "Demons of Florida",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "shifter", "demon", "wolf"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2013,
            "tagline": "Demons of Florida #3",
            "Amz": "B00C4BZILO",
            "Nook": 2940016455785,
            "Kobo": "demon-branded",
            "CrSpace": 4229978,
            "AmzPrint": 1484015703,
            "blurb": "Tiago Montevedo has one chance to stop the demons determined to take over what's left of Florida. It's simple. Join forces with a she-wolf whose sole purpose is to kill every hellion stupid enough to cross her path. Except...this she-wolf isn't ready for a partner, much less take demon spawn as a mate. But a man with Montevedo demon blood has a lure no woman can resist, and once she's in his bed, she won't want to leave. If only he could get her to stop fighting long enough to show her just how serious he is."
        },
        {
            "id": 20121008,
            "title": "MetalMark",
            "PageURL": "book.php?title=MetalMark",
            "cover125": "MetalMark125.jpg",
            "cover240": "MetalMark240.jpg",
            "heatlevel": "spicy",
            "series": "stand-alone",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "SFR", "steampunk", "space opera"],
            "pub": "Soon to be re-released",
            "length": "Novel (ebook)",
            "date": 2010,
            "tagline": "Revenge may kill her, but love may kill them all.",
            "Amz": "B07H574LD3",
            "AmzPrint": 1616508671,
            "blurb": "\n\t<p>Prince to a dying planet, Lye the Keeper has made a deal with the devil. For the price of his blood, the Drianti Syndicate offer a seat on their council...and put the end to their decade-long occupation of his planet within his grasp. Working with the Syndicate feels like betraying everything he's worked for these last ten years, but it pales in comparison to the pain of his monthly mating imperative.\n<\/p><p>\nThe red-haired temptress who lands in his path holds the key to Lye's freedom--and an end to his pain--but the price is too high. Touching her would defile the royal line that ends with him. The lure to possess her, however, proves irresistible.\n<\/p><p>\nPrivateer Jazzelina Eval will do anything to bring down the Syndicate, anything from robbing spaceships to kidnapping a prince. Anything but settle down and give up the revenge game. Or bed a mark who's made a deal with her enemy. But once she has Lye in her hands, she can't let him go...even if the price of keeping him is war.\n<\/p><p>\nWARNING: Explicit content, exploding space ships, and creepy biomechanical bugs\n<\/p>\n\t"
        },
        {
            "id": 20121230,
            "title": "Dragon Rodeo",
            "PageURL": "book.php?title=Dragon%20Rodeo",
            "cover125": "DragonRodeo125x188.jpg",
            "cover240": "DragonRodeo240x360.jpg",
            "heatlevel": "erotic",
            "series": "stand-alone",
            "genre": "Fantasy Erotic Romance",
            "keyword":  ["fantasy", "alternate dimension", "erotic romance", "dragon"],
            "pub": "Ella Drake",
            "length": "short story (ebook)",
            "date": 2012,
            "tagline": "alternate dimension/Fantasy.",
            "blurb": "Drawn to her local museum, Kellie can’t keep away from a certain compelling painting. The oils seem real and the scent of the scene, nearly tangible. When the artist approaches her, his touch sends them into a world of fantasy, of dragons. Their passion ignites and reality blurs. Rand, the intriguing bronc rider, is hers, if only she learns how to keep him.",
            "buy": "Temporarily out of print."
        },
        {
            "id": 20090529,
            "title": "Wolf-Bitten",
            "PageURL": "book.php?title=Wolf-Bitten",
            "cover125": "wolfbitten125.jpg",
            "cover240": "wolfbitten240.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Demons%20of%20Florida\">Demons of Florida<\/a>\n\t",
            "series": "Demons of Florida",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "shifter", "demon", "wolf"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2012,
            "tagline": "Demons of Florida #2",
            "Amz": "B009DUVR9Q",
            "Nook": 2940016107554,
            "Kobo": "wolf-bitten",
            "CrSpace": 4229978,
            "AmzPrint": 1484015703,
            "blurb": "Never run from a werewolf, unless you want to get caught.\n\nHe is her betrothed, her erotic dream, her worst nightmare. Allie is a woman on the run. Brock is the werewolf hunting her.\n\nAllie ran from home to avoid her fiance, Brock. Unwilling to tie herself to a werewolf, she wars with her divided longing to run to him, and her urge to run away.\n\nEager to make Allie his mate and prove he isn't an animal, Brock escapes captivity by the enemy, the Hunters of Orion, a militant group backed by the demons now plaguing Florida. Brock is of the PACk, a community of shifters sensitive to petroleum. He braves the gas clogged suburbs to track down his errant mate. Together, their passion ignites, but before returning to the PACk, they must escape the clutches of the dreaded Orions."
        },
        {
            "id": 20091002,
            "title": "Scent of Cin",
            "PageURL": "book.php?title=Scent%20of%20Cin",
            "cover125": "ScentofCin125.jpg",
            "cover240": "ScentofCin240.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Demons%20of%20Florida\">Demons of Florida<\/a>\n\t",
            "series": "Demons of Florida",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "shifter", "demon", "wolf"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2012,
            "tagline": "Demons of Florida #1",
            "Amz": "B0099YUHJC",
            "Nook": 2940044958418,
            "CrSpace": 4229978,
            "AmzPrint": 1484015703,
            "blurb": "It took death for Cinnamon Murphy to find her love, a sexy half-demon she can't resist.\n\nHalf-demon Vedo resurrects the newly-dead Cinnamon Murphy, detective, bane of the Hellions - and all woman. Vedo needs her to find his son, product of a forced union with a powerful demoness, but Vedo gets more than he bargains for. Once Cin is no longer a shade, her scent becomes a lure his Nephilim nature can't resist. Cin finds that being raised from the dead gives her uncontrollable cravings for heat, especially for the hot man who needs her help, a man she's sworn to kill.\n\nIt's a race to the summer solstice, the stakes are for eternity, the passion is not of this world, and love is an ill afforded weakness."
        },
        {
            "id": 20120512,
            "title": "Desire the Banshee",
            "PageURL": "book.php?title=Desire%20the%20Banshee",
            "cover125": "desirethebanshee125.jpg",
            "cover240": "desirethebanshee240.jpg",
            "cover360": "desirethebanshee360.jpg",
            "heatlevel": "erotic",
            "seriesURL": "\n\t<a href=\"series.php?title=Cinder%20Mated\">Cinder Mated<\/a>\n\t",
            "series": "Cinder Mated",
            "genre": "Erotic Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "Elementals"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2012,
            "tagline": "Cinder Mated #1",
            "Amz": "B01ATV3RQ8",
            "AmzPrint": 1539517160,
            "blurb": "\n\t<p>Daisy is a banshee, a mage of sound. On missions for the Cinder Task Force, her handler Sean joins her telepathically to help control her turbulent powers. What she really wants is a little hands-on-Sean time, but that’s impossible. She’s never seen him in the flesh.\n\t<\/p><p>Deaf since the onset of his para-talent, Sean can only hear when inside Daisy’s thoughts. He dreams of possessing her, but fears the worst—that fulfilling the sexual lust between them will lower his shields and he’ll shatter her mind.\n\t<\/p><p>A rogue group has gathered and targets Daisy. Sean has to act. They’re finally in the same room, their powers meld and their bodies want nothing more than to do the same—again and again. But to rescue Daisy, they have to put aside the raging attraction. Easier said than done.<\/p>\n\t",
            "buy": ""
        },
        {
            "id": 20120423,
            "title": "Desert Blade",
            "PageURL": "book.php?title=Desert%20Blade",
            "cover125": "DesertBlade125.jpg",
            "cover240": "DesertBlade240.jpg",
            "heatlevel": "spicy",
            "series": "New Guardsmen",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "post-apocalyptic", "SFR"],
            "pub": "Carina Press",
            "length": "Novella (ebook)",
            "date": 2012,
            "tagline": "Love survives in the post-apocalyptic Midwest",
            "Carina": "9781426893674_desert-blade",
            "Amz": "B0070XZYXI",
            "Nook": 9781426893674,
            "Kobo": "desert-blade",
            "iTune": "id511055215",
            "audible": "B007VEFPU8",
            "googlebooks": "id=FI3ErfJ0i3IC",
            "blurb": "Derek Covington has no luck. Civilization has fallen. He’s lost his family, his home. All he has going for him is his replacement arm, his sword—the weapon of choice for survival in the deserts covering what used to be America.\nHis luck is about to change. \nDoctor Lidia Covington survived the downfall of Chicago, the riots, the hunger. Now safe in a community guarded by the military in Leavenworth, she hides from danger and from her heart.\nWhen she meets Derek again, she leaves safety to help him save a sick child. Together, the heat grows and she can no longer hide. She wants to feel again, to live, but when the drifter gangs descend, she finds it might be too late.",
            "buy": ""
        },
        {
            "id": 20111119,
            "title": "Braided Silk",
            "PageURL": "book.php?title=Braided%20Silk",
            "cover125": "BraidedSilk125.jpg",
            "cover240": "BraidedSilk240.jpg",
            "heatlevel": "spicy",
            "seriesURL": "\n\t<a href=\"sort.php?series=Future%20Tales\">Future Tales<\/a>\n\t",
            "series": "Future Tales",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "SFR", "biopunk", "fairytale"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": "2011, revised 2015",
            "tagline": "A futuristic fairy tale. Future Tales 2, Rapunzel",
            "Amz": "B010EJQHLC",
            "Nook": 2940150906471,
            "Kobo": "braided-silk-2",
            "iTune": "id1013568139",
            "blurb": "\n\t<p>Rapunzel was made with technologically advanced hair. As a trained Mother agent, Zel can't escape the DNA that makes her a pawn in corporate espionage. Kidnapped and held in a tower on Gothel Island, she falls to the sexual allure of her captor’s son, Langley, a man whose every tantalizing touch makes her forget she wasn’t born human.<\/p>\n\t<p>Langley Gothel protests the existence of creations such as Zel, but when faced with losing her, he sees the truth: Life is precious, whether born, modified, or shaped in a Petri dish. He does the one thing he's thought he'd never do. He has to give up Zel, or become a mod. But will that be enough to get them down from the floating islands and safely to ground?<\/p>\n\t",
            "buy": ""
        },
        {
            "id": 20110221,
            "title": "Jaq's Harp",
            "PageURL": "book.php?title=Jaq%27s%20Harp",
            "cover125": "ED_JaqsHarp125.jpg",
            "cover240": "ED_JaqsHarp240.jpg",
            "heatlevel": "spicy",
            "seriesURL": "\n\t<a href=\"sort.php?series=Future%20Tales\">Future Tales<\/a>\n\t",
            "series": "Future Tales",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "SFR", "biopunk", "fairytale"],
            "pub": "Carina Press",
            "length": "Novella (ebook)",
            "date": 2011,
            "tagline": "A futuristic fairy tale. Future Tales 1, Jaq",
            "Carina": "9781426891236_jaqs-harp",
            "Amz": "B004K1F7V2",
            "Nook": 9781426891236,
            "Kobo": "jaq-s-harp",
            "iTune": "id496901500",
            "audible": "B004OYSJB0",
            "googlebooks": "id=SF-U33h5aH0C",
            "blurb": "In a world of floating islands and bio-engineered beans, the bad guys are taken down by agents of the Mother organization—agents like Jacqueline “Jaq” Robinson. Instead of accepting her next routine assignment, she sets out on a mission of her own—to destroy Giant Corp, the company responsible for her sister’s wasting illness. Jaq must steal her cure from Giant’s headquarters high above the city…even though she’ll be brought face-to-face with Harper English, the man who left her to go deep undercover at Giant.\n\nFor Harp, Jaq had been a distraction the mercenary thought he couldn’t afford. But once he sees her again, Harp knows he’s made a mistake. Even though she vowed he won’t have her again, it’s clear they still have a powerful attraction. Harp’s determined to get a second chance with Jaq—if they can escape Giant Corp and get back to solid ground in one piece…"
        },
        {
            "id": 20101122,
            "title": "Silver Bound",
            "PageURL": "book.php?title=Silver%20Bound",
            "cover125": "ED_SilverBound125.jpg",
            "cover240": "ED_SilverBound240.jpg",
            "heatlevel": "spicy",
            "series": "Silver Bound",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "SFR", "space western", "erotic romance", "Silver Bound"],
            "pub": "Carina Press",
            "length": "Novel (ebook)",
            "date": 2010,
            "tagline": "A dangerous journey across the galaxy.",
            "Amz": "B004774YOU",
            "Nook": 9781426890796,
            "Kobo": "silver-bound",
            "iTune": "id496893925",
            "googlebooks": "id=-jODFYokcQsC",
            "Carina": "9781426890796_silver-bound",
            "audible": "B004FOL7KY",
            "blurb": "A dangerous journey across the galaxy\n\tSheriff Guy Trident doesn’t have much to do with off-worlders; he has his hands full keeping his own planet safe. But he’ll do anything, go anywhere to save Jewel Quinn. She broke his heart years ago when she left to marry a Terraloft aristocrat. Now she’s run away from her husband, only to fall into the clutches of slavers.\n\tPosing as a wealthy playboy, Guy arrives at Zuthuru Station to learn he’s too late: Jewel’s memories have been erased. She’s been tipped in silver, a process that leaves nothing behind except her body, sexually bound to pleasuring her master. Unwilling to give up hope, Guy buys her.\n\tJewel fights to reclaim herself, recalling a different connection to the handsome sheriff, remembering the frightened eyes of a young boy and the events that made her run. Together she and Guy search for her cure, plan her son’s rescue from her ruthless ex, and test if they have any kind of future...before the past catches up to them.",
            "buy": ""
        },
        {
            "id": 20091027,
            "title": "The Forbidden Chamber",
            "PageURL": "book.php?title=The%20Forbidden%20Chamber",
            "cover125": "ForbiddenChamber125.jpg",
            "cover240": "ForbiddenChamber240.jpg",
            "heatlevel": "spicy",
            "series": "stand-alone",
            "genre": "Paranormal Romance",
            "keyword":  ["erotic paranormal romance", "erotic PNR", "PNR", "shifter", "raven", "historical paranormal", "fairytale"],
            "pub": "Samhain",
            "length": "Novel (print/ebook)",
            "date": 2010,
            "tagline": "'Your life is forfeit if you open that door.'",
            "Amz": "B01MUDXWMD",
            "Nook": 2940154169360,
            "Kobo": "the-forbidden-chamber-2",
            "AmzPrint": 1605047848,
            "blurb": "All her life, Lady Isabel Colven has followed the path laid out for her, content to look neither left nor right for excitement. Her future holds a dutiful, passionless marriage to some nice young man, and she’s content…until the exotic and compelling Lord Rukh Hayle threatens her maidenly reserve. Rumor paints him as a wife-murderer; desire tempts her to look past his aura of danger.\n\nRukh refuses to let his family’s curse kill a third bride, but Isabel awakens the Raven within him, compels him to take her to wife—and to bed—despite the secrets that live under his skin. That lie is locked in the darkest corners of the manor, waiting to be unleashed. Their lusty union arouses the curse, entangling Isabel in an erotic tug of war that can only end in her destruction. There is no escape for either of them. Not from his family’s shadowy history. Not from demons imagined and real. And not from the choice Rukh faces to save his bride from a fate worse than death…\n\nWarning: This gothic contains heady kisses that lead to ruin, passionate sex on a desk chair, a mysterious husband who may be a murderer, a cursed family of raven shifters, and an unspeakable evil hidden in the closet."
        },
        {
            "id": 20091207,
            "title": "Firestorm on E'Terra",
            "PageURL": "book.php?title=Firestorm%20on%20E%27Terra",
            "cover125": "Firestorm125.jpg",
            "cover240": "Firestorm240.jpg",
            "heatlevel": "erotic",
            "series": "stand-alone",
            "genre": "Science Fiction Romance",
            "keyword":  ["science fiction romance", "SFR", "action adventure", "erotic romance"],
            "pub": "Ella Drake",
            "length": "Novella (ebook)",
            "date": 2009,
            "tagline": "Fire meets ice, the storm flames out of control.",
            "Amz": "B0071NUV2G",
            "Nook": 2940033013197,
            "Kobo": "firestorm-on-e-terra",
            "iTune": "id542132694",
            "blurb": "When fire meets ice, the storm flames out of control.\n\nSmokejumper and former refugee Wilson Dex takes the latest in a long line of risks, a mission to quell the firestorm on planet E'terra.\n\nEquipment from his transport ship malfunctions, forcing by-the-book Commander Samantha Varde dirtside to help Dex though she suffers from landsickness.\n\nWhile fighting the ill-timed and against-code heat between them, they have hours to reprogram a torpedo, fly into a tornado, and chute into a firestorm, all to save the colony before the storm flames out of control."
        }
    ]
}